# 비교 연산자
# 비교 연산의 결과는 무조건 True 또는 False로 나옴
# ==    :같으면 True,다르면 falsefh로 나옴
# !=    :다르면 True,같으면 false
# <
# >
# <=
# >=  

# print(5 != 2)
# print(5 < 2)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 


# 주간식 종류

# [가장 일반적인 형식]
# if(조건식) :
#       if의 조건식이 True일 경우 실행할 코드
# elif(조건식):
#       위의 조건식들이 false이고 elif의 조건식이 true일 경우 실행할 경우 실행할 코드
# else :
#       위의 모든 조건식이 palse이고 elif의 조건식이 True일 경우 실행할 코드
# else :
#      위의 모든 조건식이 palse일 경우 실행할 코드



# [if란 elif만 사용한 경우]
# if(조건식) :
#      if의 조건식이 True일 경우 실행할 코드
# elif(조건식) :
#      위의 조건식들이 false이고 조건식이 True일 경우 실행할 코드


 
